tap "dteoh/sqa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "bluetoothconnector"
brew "fzf"
brew "git"
brew "git-flow"
brew "glib"
brew "htop"
brew "influxdb-cli"
brew "influxdb@1"
brew "sqlite"
brew "libheif"
brew "mas"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "pypy"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "unbound"
brew "zlib"
brew "zsh"
cask "aldente"
cask "alfred"
cask "amethyst"
cask "bartender"
cask "dictionaries"
cask "dropbox"
cask "elmedia-player"
cask "figma"
cask "insta360-studio"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "monitorcontrol"
cask "obsidian"
cask "onyx"
cask "parallels"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "visual-studio-code"
