if OS.mac?
    # Taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    # Fonts
    cask "font-jetbrains-mono-nerd-font"
end

tap "homebrew/core"
tap "homebrew/services"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# miscs
brew "fzf" # fuzzy-finder https://github.com/junegunn/fzf
brew "curl" # https://github.com/curl/curl
brew "neovim"
brew "tmux"
brew "mas" # Mac automation https://github.com/mas-cli/mas
brew "git"
brew "htop"
brew "nvm"
brew "npm"
brew "pyenv"
brew "pypy"
brew "ripgrep"
brew "tree"

## Casks - actual visual software 
cask "aldente"
cask "alfred"
cask "amethyst"
cask "bartender"
cask "dictionaries"
cask "dropbox"
cask "elmedia-player"
cask "figma"
cask "insta360-studio"
cask "iterm2"
# cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
# cask "microsoft-powerpoint"
cask "microsoft-teams"
# cask "microsoft-word"
cask "monitorcontrol"
cask "obsidian"
cask "onyx"
cask "parallels"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "visual-studio-code"

# Mac App Store Installations
# mas "Xcode", id: 497799835
