if OS.mac?
    # Taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    # Fonts
    cask "font-jetbrains-mono-nerd-font"
end

tap "homebrew/core"
tap "homebrew/services"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# miscs
brew "bat"      # modern cat https://github.com/sharkdp/bat
brew "curl"     # https://github.com/curl/curl
brew "direnv"
brew "exa"      # ls replacement https://github.com/ogham/exa
brew "fd"       # modern find https://github.com/sharkdp/fd
brew "fzf"      # fuzzy-finder https://github.com/junegunn/fzf
brew "git"
brew "htop"
brew "mas"      # Mac automation https://github.com/mas-cli/mas
brew "neovim"
brew "npm"
brew "nvm"
brew "pyenv"
brew "pypy"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "zoxide"  # smarter cd command https://github.com/ajeetdsouza/zoxide

## Casks - actual visual software 
cask "aldente"
cask "alfred"
cask "amethyst"
cask "bartender"
cask "dictionaries"
# cask "dropbox"
cask "elmedia-player"
cask "figma"
cask "insta360-studio"
cask "iterm2"
cask "kitty"
cask "monitorcontrol"
cask "obsidian"
cask "onyx"
# cask "parallels"
# cask "spotify"
# cask "steam"
# cask "the-unarchiver"
cask "visual-studio-code"
