if OS.mac?
    # Taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    # Fonts
    cask "font-jetbrains-mono-nerd-font"
end

tap "homebrew/core"
tap "homebrew/services"

# Shell
brew "zsh"
brew "zsh-vi-mode"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# miscs
brew "bat"              # modern cat https://github.com/sharkdp/bat
brew "bear"             # Bear is a tool that generates a compilation database for clang tooling
brew "curl"             # https://github.com/curl/curl
brew "direnv"
brew "docker"
brew "docker-compose"
brew "exa"              # ls replacement https://github.com/ogham/exa
brew "fd"               # modern find https://github.com/sharkdp/fd
brew "fzf"              # fuzzy-finder https://github.com/junegunn/fzf
brew "git"
brew "htop"
brew "lazygit"          # Terminal git GUI https://github.com/jesseduffield/lazygit
brew "mas"              # Mac automation https://github.com/mas-cli/mas
brew "neovim"
brew "npm"
brew "nvm"              # Node (JS) Version Manager https://github.com/nvm-sh/nvm
brew "pyenv"            # Python Version Manager https://github.com/pyenv/pyenv
brew "pypy"             # Python JIT (Just-In-Time) Interpreter 
brew "rbenv"            # Ruby Version Manager
brew "ripgrep"
brew "ruby-build"
brew "tmux"
brew "tree"
brew "zoxide"           # smarter cd command https://github.com/ajeetdsouza/zoxide

## Casks - actual visual software 
cask "aldente"
cask "alfred"
cask "amethyst"
cask "bartender"
cask "dictionaries"
cask "docker"
cask "iterm2"
cask "kitty"
cask "logi-options-plus"
cask "monitorcontrol"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wireshark"
