# --- Taps ---
tap "hudochenkov/sshpass"
tap "nobbmaestro/tap"

# --- Shell & Prompt ---
brew "nobbmaestro/tap/lazyhis"
brew "starship"
brew "zoxide"           # smarter cd command https://github.com/ajeetdsouza/zoxide
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# --- Version Managers ---
brew "nvm"              # Node (JS) Version Manager https://github.com/nvm-sh/nvm
brew "rbenv"            # Ruby Version Manager
brew "ruby-build"
brew "uv"               # Python package and project manager https://github.com/astral-sh/uv

# --- Tools & Utilities ---
brew "bear"             # Bear is a tool that generates a compilation database for clang tooling
brew "bob"              # Bob, A version manager for neovim
brew "cmake"
brew "container"
brew "curl"             # https://github.com/curl/curl
brew "direnv"
brew "eza"              # ls replacement https://github.com/eza-community/eza
brew "fd"               # modern find https://github.com/sharkdp/fd
brew "fzf"              # fuzzy-finder https://github.com/junegunn/fzf
brew "git"
brew "git-flow"         # git extention for git flow workflow https://github.com/nvie/gitflow
brew "go"
brew "htop"
brew "lazygit"          # Terminal git GUI https://github.com/jesseduffield/lazygit
# brew "lazydocker"
brew "mas"              # Mac automation https://github.com/mas-cli/mas
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tldr"             # Collaborative cheatsheets for console commands https://github.com/tldr-pages/tldr
brew "yazi"

# --- Dev Utilities ---
brew "arduino-cli"
brew "arm-none-eabi-gcc"
brew "arm-none-eabi-gdb"
brew "docker"
brew "gitlab-ci-local"
brew "hudochenkov/sshpass/sshpass"

# --- Casks (GUI apps) ---
if OS.mac?
    # Fonts
    cask "font-jetbrains-mono-nerd-font"

    cask "nikitabobko/tap/aerospace"
    cask "aldente"
    cask "alfred"
    cask "bartender"
    cask "dictionaries"
    cask "docker"
    cask "karabiner-elements"
    cask "kitty"
    # cask "logi-options-plus"
    cask "monitorcontrol"
    cask "obsidian"
    # cask "parallels"
    cask "saleae-logic"
    cask "spotify"
    cask "the-unarchiver"
    cask "wireshark"

    # mas "AdGuard for Safari", id: 1440147259
    # mas "Amphetamine", id: 937984704
    # mas "Vimlike", id: 1584519802
end
